'''2. Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями, 3, 15, 6, 4, 2,
второй массив надо заполнить значениями 0, 3, 4, 5, (индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.'''

'''Мой самолёт опять мог бы упасть в Мёртвое море...
Я использовал array.index(item) и мог пропустить повторяющиеся индексы.'''

import random

SIZE = 10
MIN_ITEM = -100
MAX_ITEM = 100
array = [random.randint(MIN_ITEM, MAX_ITEM) for _ in range(SIZE)]
print(array)

result = []
for i, item in enumerate(array):
    if item % 2 == 0:
        result.append(i)
print(f'Индексы четных элементов: {result}')